Недавно поставили задачу, проанализировать возможность перехода с maven на gradle.
Преимуществ у gradle много. Основное, это сборка проекта с использованием Gradle производительнее maven, подробнее тут https://gradle.org/gradle-vs-maven-performance/
Он может делать все тоже самое что и maven. Где-то чуть больше сконфигурировать (pom.xml), а где-то конфигурировать меньше и проще.
Объем текста меньше (xml никогда не был краток).
Уперся в кучку кастомных maven плагинов. В gradle их нельзя просто так использовать. Нужно или адаптировать или вызывать через лишнюю логику (exec). Вызов через прослойки осложнен тем что плагины не поддерживают инкрементальные сборки. Там на основе xml создаются java классы. В общем, трудозатратно.
Исходников у плагинов нет. Декомпилировал и попробовал реверс-инжиниринг - так там, как-будто, обфускатором поработали и без того отсутствующих, после компиляции, аннотаций и комментариев, которые используются в maven при написании плагинов.
В общем, все варианты трудозатратны.
Зато разобрался как писать плагины для maven и gradle.
